content/man/man1/expiry.1.org
#+TITLE: Manpages - expiry.1
* NAME
expiry - check and enforce password expiration policy

* SYNOPSIS
*expiry* /option/

* DESCRIPTION
The *expiry* command checks (*-c*) the current password expiration and
forces (*-f*) changes when required. It is callable as a normal user
command.

* OPTIONS
The options which apply to the *expiry* command are:

*-c*, *--check*

#+begin_quote
Check the password expiration of the current user.

#+end_quote

*-f*, *--force*

#+begin_quote
Force a password change if the current user has an expired password.

#+end_quote

*-h*, *--help*

#+begin_quote
Display help message and exit.

#+end_quote

* FILES
/etc/passwd

#+begin_quote
User account information.

#+end_quote

/etc/shadow

#+begin_quote
Secure user account information.

#+end_quote

* SEE ALSO
*passwd*(5), *shadow*(5).
